//հարց 1
let harc1 =(prompt("Հարց 1–նշվածներից վոր թվականին է ծնվել Հովհաննես Թումանյանը(1873 , 1869 , 1857 ,1865 )"));

if(harc1==1869){
    alert("դուք ճիշտ պատասխանեցիք հարցին")
}
else if(harc1==1873,1857,1865){
    alert("դուք սխալ պատասխանեցիք հարցին")
}

//հարց 2
let harc2 =(prompt("Հարց 2–նշվածներից վոր թվականին է  քրիստոնեությունը ընթունվել պետական կրոն(405 , 305 , 301 ,401 )"));

if(harc2==301){
    alert("դուք ճիշտ պատասխանեցիք հարցին")
}
else if(harc2==405,305,401){
    alert("դուք սխալ պատասխանեցիք հարցին")
}
//հարց 3
let harc3 =(prompt("Հարց 3–նշվածներից(1,2,3,4) ով է  եղել պատմաբան 1.Հովհաննես Թումանյան , 2.Մովսես Խորենացին , 3.Եղիշե Չարենց , 4.Հովհաննես Շիրազ"));

if(harc3==2){
    alert("դուք ճիշտ պատասխանեցիք հարցին")
}
else if(harc3==1,3,4){
    alert("դուք սխալ պատասխանեցիք հարցին")
}
//հարց 4
let harc4 =(prompt("Հարց 4–նշվածներից որ թվականին է տեղի ունեցել Հայերի ցեղասպանությունը 1920 , 1910 ,1915 ,1925"));

if(harc4==1915){
    alert("դուք ճիշտ պատասխանեցիք հարցին")
}
else if(harc4==1920 , 1910 , 1925){
    alert("դուք սխալ պատասխանեցիք հարցին")
}

//հարց 5
let harc5 =(prompt("Հարց 5–նշվածներից որ թվականին է ծնվել Իսահակ Նյուտոն 1642,1664,1748,1646"));

if(harc5==1642){
    alert("դուք ճիշտ պատասխանեցիք հարցին")
}
else if(harc5==1664 , 1748 , 1646){
    alert("դուք սխալ պատասխանեցիք հարցին")
}
//հարց 6
let harc6 =(prompt("Հարց 6–նշվածներից որն է  Բնակչությամբ աշխարհի խոշորագույն պետությունը 1․Ռւսաստան,2․Հնդկաստան,3․Չինաստանը,4․Ամերիկան"));

if(harc6==3){
    alert("դուք ճիշտ պատասխանեցիք հարցին")
}
else if(harc6==1,2,4){
    alert("դուք սխալ պատասխանեցիք հարցին")
}
//հարց 7
let harc7 =(prompt("Հարց 7–նշվածներից որն է ամենամեծ գետը 1․Նեղոս2․Ամազոն3․Եփրատ4․Արաքս"));

if(harc7==2){
    alert("դուք ճիշտ պատասխանեցիք հարցին")
}
else if(harc7==1,3,4){
    alert("դուք սխալ պատասխանեցիք հարցին")
}
//հարց 8
let harc8 =(prompt("Հարց 8–նշվածներից  որն է Աշխարհի ամենամեծ ծառը  1․Չինար,2․Սեկվոյա,3․Գեներալ Շերմանն,4․էվկալիպտները"));

if(harc8==3){
    alert("դուք ճիշտ պատասխանեցիք հարցին")
}
else if(harc8==1,2,4){
    alert("դուք սխալ պատասխանեցիք հարցին")
}

//հարց 9
let harc9 =(prompt("Հարց 9–Ինչի է հավասար 2+5*2*6-7=? 1.107,2.65,3.55,4.133"));

if(harc9==55){
    alert("դուք ճիշտ պատասխանեցիք հարցին")
}
else if(harc9==107,65,133){
    alert("դուք սխալ պատասխանեցիք հարցին")
}
//gnahatakan
var patasxan = (alert("ձեր արդյունքները"))
let a =0;
let b =0;
let c =0;
let d =0;
let e =0;
let f =0;
let g =0;
let p =0;
let h =0;
if(harc1==1869){
 ++a
}
 if(harc2==301){
 ++b   
}
if (harc3==2){
       ++c
}
if (harc4==1915){
    ++d
}
if (harc5==1642){
    ++e
}
if (harc6==3){
    ++f
}
if (harc7==2){
    ++g
}
if (harc8==3){
    ++p
}
if (harc9==55){
    ++h
}
alert(
    a+b+c+d+e+f+g+p+h
)


